// ЛР2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <locale>
#include <cmath>
using namespace std;


int main()
{
	setlocale(LC_ALL, "RUS");
	double x, y;
	cout << "Ведите координаты точки через пробел:";
	cin >> x >> y;
	if (y > 0)
	{
		if (x >= 0) // первая четверть
		{
			if (y >= 1 && x != 0)//y=1 не вкл (0;1)
			{
				cout << "4"; 
			}
			else if (y > 1 && x == 0)//от (0;1) не вкл до +беск ось y
			{
				cout << "5";
			}
			else if (y < (-1) * x + 1)//у=-х+1 не вкл (0;1)
			{
				cout << "15";
			}

			else if (((pow((-1) * (x - 1), (1.0 / 3.0)) >= y) || (y = (-1) * x + 1) || (x == 0 || y == 1))&&x<=1) //-nan(ind)! загагулистая дрянь+(0;1)+гипотенуза 15
			{
				cout << "18";
			}
			else
			{
				cout << "3";
			}
				
			
	
		}
		else // вторая четверть
		{
			if (y > ((-1) * x + 1))// не вкл у==-х+1, над у==-х+1 
			{
				cout << "5";

			}
			else if (y == ((-1) * x + 1) || (pow((-1) * (x - 1), (1.0 / 3.0)) < y))//у==-х+1 вкл загаг не вкл то что ниже
			{
				cout << "6";

			}
			else if ((pow((-1) * (x - 1), (1.0 / 3.0)) >= y)&&y>1)//у!=1, под загагулистой дрянью не вкл то что ниже
			{
				cout << "7";
			}
			else if (y <= 1)
			{
				cout << "8";//у=1
			}
			
		}
	}
	else 
	{
		if (y == x && x == 0)// точка 0;0
		{
			cout << "16";
		}
		else if (x <= 0) // третья четверть
		{
			if (y < (-1) * pow(x, 2) && pow((pow(x, 2) + pow(y, 2)), 0.5) <= 2 && (-1) * pow(x, 2) != pow((pow(x, 2) + pow(y, 2)), 0.5))//под параболой не вкл ее саму т пересеч окр и пар вкл ох до-2 и кусок ок-ти 
			{
				cout << "13";
			}
			else if (y <= (-1) * pow(x, 2) && pow((pow(x, 2) + pow(y, 2)), 0.5) > 2 && (-1) * pow(x, 2) != pow((pow(x, 2) + pow(y, 2)), 0.5) && x != 0)//вкл под параболой и ее саму не вкл т пересеч окр и пар ох и кусок ок-ти
			{
				cout << "10";
			}
			else if ((-1) * pow(x, 2) == pow((pow(x, 2) + pow(y, 2)), 0.5) || (y >= (-1) * pow(x, 2) && pow((pow(x, 2) + pow(y, 2)), 0.5) <= 2))//вкл т пересеч окр и пар 
			{
				cout << "14";
			}
			else if (x != 0)
			{
				cout << "9";
			}
			else
			{
				cout << "11";
			}
		}
		else //четвертая четверть

		{
			if (y < (-1) * pow(x, 2) && pow((pow(x, 2) + pow(y, 2)), 0.5) <= 2 && x != 0)
			{
				cout << "12";
			}
			else if (y <= (-1) * pow(x, 2) && pow((pow(x, 2) + pow(y, 2)), 0.5) > 2)
			{
				cout << "11";
			}
			else if (x == 1 && y == 0)
			{
				cout << "18";
			}
			else if (y < (-1) * x + 1 && pow((pow(x, 2) + pow(y, 2)), 0.5) <= 2)
			{
				cout << "16";
			}
			else if (y < (-1) * x + 1)
			{
				cout << "1";
			}
			else if (y >= (-1) * x + 1 && pow((pow(x, 2) + pow(y, 2)), 0.5) <= 2)
			{
				cout<<"17";
			}
			else
			{
				if (y == 0)
				{
					cout << "3";
				}
				else
				{
					cout << "2";
				}
			}
			
		}
	}
	
}